# 1.先定义函数
def show1():
    print('--------------show1函数开始-----------------')
    try:
        print(1 / 0)
    except Exception as e:
        print(e)
    print('--------------show1函数结束-----------------')


def show2():
    print('--------------show2函数开始-----------------')
    show1()
    print('--------------show2函数结束-----------------')


if __name__ == '__main__':
    # 2.在main中调用函数
    print('--------------main函数开始-----------------')
    show2()
    print('--------------main函数结束-----------------')
