import pandas as pd

# DataFrame的创建

# 基于字典创建
data = {
    '姓名': ['张三', '李四', '王五', '赵六'],
    '年龄': [25, 30, 35, 28],
    '城市': ['北京', '上海', '广州', '深圳'],
    '工资': [5000, 7000, 6000, 8000],
}

# 手动指定行索引的名字，默认都是0-1-2-3

df = pd.DataFrame(
    data,
    columns=['姓名', '年龄', '城市', '工资'],  # 手动提供列索引的名字
    index=['员工1', '员工2', '员工3', '员工4'],  # 手动提供行索引的名字
)

# 查看数据

# 查看前几行数据
print(df.head(2))  # 查看前两行数据

# 查看后几行数据
print(df.tail(2))  # 查看后两行数据


# 查看数据的基本信息
print("df的信息：", df.describe())  # 查看数据的详情信息


# 选择列
# 单独看姓名列
print(df['姓名'])  # 选择单列数据，返回Series类型
print(type(df['姓名']))  # 查看数据类型
# 选择多列
print(df[['姓名', '年龄']])  # 选择多列数据，返回DataFrame类型
print(type(df[['姓名', '年龄']]))  # 查看数据类型


# 通过行选择数据
# 通过行索（索引名称）选择单行数据

print(df.loc['员工1'])  # 通过行索引选择单行数据，返回Series类型
print(type(df.loc['员工1']))  # 查看数据类型

# 通过行索引选择多行数据
print(
    "第一行和第三行数据：", df.loc[['员工1', '员工3']]
)  # 通过行索引选择多行数据，返回DataFrame类型
print(type(df.loc[['员工1', '员工3']]))  # 查看数据类型


# 用行整数位置选择单行数据
print("第一行数据：", df.iloc[0])  # 通过行索引选择单行数据，返回Series类型

print(
    "第一行和第三行数据：", df.iloc[[0, 2]]
)  # 通过行索引选择多行数据，返回DataFrame类型

print("前三行数据：", df.iloc[0:3])  # 通过行索引选择多行数据，返回DataFrame类型

# 切片
print("切片：", df[1:3])  # 通过切片选择数据，返回DataFrame类型
