# 1.定义空字典
d1 = {}
d2 = dict()
print(d1, d2)
print(type(d1), type(d2))

# 2.定义非空字典
# 注意:如果key重复,默认后面的值覆盖前面的值
d3 = {'a': 1, 'b': 2, 'c': 3, 'a': 11}
print(d3, type(d3))
# 注意:因为key不能重复,所以key不能是可变类型,但是值可以是任意类型
d4 = {
    '整数': 10,
    '浮点数': 3.14,
    '布尔': True,
    '字符串': 'abc',
    '列表': [1, 2, 3],
    '元组': (1, 2, 3),
    '集合': {1, 2, 3},
    '字典': {1: 1, 2: 2},
}
print(d4, type(d4))
d5 = {
    10: '整数',
    3.14: '浮点数',
    True: '布尔',
    'abc': '字符串',
    (1, 2, 3): '元组',
    # [1, 2, 3]:'列表',
    # {1, 2, 3}:'集合',
    # {1: 1, 2: 2}:'字典'
}
print(d5, type(d5))
