# 快速复制光标所在行快捷键: ctrl+D
# 算术运算符: +  -  *  /  //  %  **
print(10 + 3)  # 13
print(10 - 3)  # 7
print(10 * 3)  # 30
print(10 / 3)  # 3.333333333...
print(10 // 3)  # 3
print(10 % 3)  # 1
print(10 ** 3)  # 1000
print("========================================")
# 赋值运算符: =
a = 12
print(a)  # 12
# 复合赋值运算符: +=  -=  *=  /=  //=  %=  **=
a += 3
print(a)  # 15
a -= 3
print(a)  # 12
a *= 3
print(a)  # 36
a /= 3
print(a)  # 12.0
a //= 3  # // 整除运算符
print(a)  # 4.0
a %= 3
print(a)  # 1.0
a **= 3
print(a)  # 1.0
