"""
range()函数的作用:生成一个整数序列,常用于for循环中
range(x,y,z)格式说明如下:
x:起始数字,如果是0可以省略
y:结束标记,真正结束数字是y-1
z:步长,1的时候可以省略
"""

for i in range(0, 10, 1):
    print(i, end="\t")
print("\n--------------------------")
for i in range(10):  # 0和1可以同时省略
    print(i, end="\t")
print("\n--------------------------")
# 需求: 打印1-10(含)中所有奇数
for i in range(1, 11, 2):
    print(i, end="\t")
print("\n--------------------------")
# 需求: 打印1-10(含)中所有偶数
for i in range(2, 11, 2):
    print(i, end="\t")
print("\n--------------------------")
# 需求: 打印1-10(含)中所有偶数和
# 循环外定义初始变量
he = 0
for i in range(2, 11, 2):
    # 循环内累加
    he += i
# 循环外使用最终结果
print(he)
